---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseError
source: html/b60beeb2-d7a3-2427-4a48-da9c0ef5fecd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseError Property

The solution is failing to do the elements Phases are compatible.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToDoCompatiblePhaseError { get; }
```